In [38]:
from sqlalchemy import create_engine
import pandas as pd
from postgres_password import pw

In [46]:
# Postgres username, password, and database name
POSTGRES_ADDRESS = 'localhost' 
POSTGRES_PORT = '5432'
POSTGRES_USERNAME = 'postgres' 
POSTGRES_PASSWORD = pw 
POSTGRES_DBNAME = 'EmployeeHW_DB'
# A long string that contains the necessary Postgres login information
postgres_str = ('postgresql://{username}:{password}@{ipaddress}:{port}/{dbname}'
    .format(username=POSTGRES_USERNAME, 
    password=POSTGRES_PASSWORD, 
    ipaddress=POSTGRES_ADDRESS, 
    port=POSTGRES_PORT,  
    dbname=POSTGRES_DBNAME)) 
# Create the connection
engine = create_engine(postgres_str) 
connection = engine.connect()

In [47]:
departments_df = pd.read_sql_table('departments', engine)  
departments_df

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [20]:
employees_df = pd.read_sql_table('employees', engine)  
employees_df.head()

   emp_no emp_title_id birth_date  first_name  last_name sex  hire_date
0  473302        s0001 1953-07-25    Hideyuki   Zallocco   M 1990-04-28
1  475053        e0002 1954-11-18       Byong  Delgrande   F 1991-09-07
2   57444        e0002 1958-01-30       Berry       Babb   F 1992-03-21
3  421786        s0001 1957-09-28       Xiong   Verhoeff   M 1987-11-26
4  282238        e0003 1952-10-28  Abdelkader    Baumann   F 1991-01-18

In [18]:
dept_emp_df = pd.read_sql_table('dept_emp', engine)  
dept_emp_df.head()

   emp_no dept_no
0   10001    d005
1   10002    d007
2   10003    d004
3   10004    d004
4   10005    d003

In [19]:
dept_manager_df = pd.read_sql_table('dept_manager', engine)  
dept_manager_df.head()

  dept_no  dept_mgr_emp_no
0    d001           110022
1    d001           110039
2    d002           110085
3    d002           110114
4    d003           110183

In [22]:
dept_manager_df = pd.read_sql_table('dept_manager', engine)  
dept_manager_df.head()

  dept_no  dept_mgr_emp_no
0    d001           110022
1    d001           110039
2    d002           110085
3    d002           110114
4    d003           110183

In [23]:
salaries_df = pd.read_sql_table('salaries', engine)  
salaries_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00

In [24]:
title_df = pd.read_sql_table('salaries', engine)  
title_df.head()

   emp_no      salary
0   10001  $60,117.00
1   10002  $65,828.00
2   10003  $40,006.00
3   10004  $40,054.00
4   10005  $78,228.00